{"data":{"markdownRemark":{"html":"<blockquote>\n<p>\"I'll just commute into town on the train and spend four nights a week in a hotel while I'm getting settled into the new role.\"</p>\n</blockquote>\n<hr>\n<p>I'm a bit embarrassed to admit that I said some version of the above quote to two different CEOs before realizing how naive it made me appear. From my perspective, I was being proactive: demonstrating my willingness to hit the ground running, and to bleed a little cash while I took care of the pesky details of finding a new home for myself. This wasn't at all the case to a manager looking for an engineer to slot into their team. It's true that I would be at the office just the same as a prospect who already lived nearby, or was willing to relocate. However, my flippant disregard of the externalities brought on by my strategy betrayed an unwillingness to make the real sacrifice of hunting down an appropriate dwelling and committing to it. In this post, I'll try to tackle the problems with my thinking, and relate what I've learned from the experience.</p>\n<h2>Energy</h2>\n<p>One of the first objections I came across, and one that was universal to all of my interviews so far, focused on the mental impact of riding a train for hours before work, and sleeping in a cheap hotel every night. My retorts took advantage of the subjective nature of this concern. After all, anything can be overcome with a little willpower! While this is certainly true when speaking of the hardships a person may encounter in their life, it's not an intelligent argument to make about a plan you've come up with on your own. A software business has a legitimate concern that their engineers will arrive every day well-rested and ready to face the intense challenges that the day may bring.</p>\n<h2>Committment</h2>\n<p>From my point of view, sticking to a commute plan allowed me to mitigate risk by maintaining my current lease. Once I had accepted the mental toll of a long-distance commute as inevitable, this became a huge upside for me. If I were to decide that the role wasn't a good fit, there would be no messy entanglements to unwind. This, I believe, was an even larger danger signal to a hiring manager than the previous point. As an executive tasked with expending significant resources in the acquisition of a talented engineer who will contribute value to the company in excess of their cost, it is an unacceptable gamble to onboard someone who has expressly developed a plan to cut ties effortlessly in the event of difficulty. Founders want an employee who will be able to take care of themselves if the worst comes to pass, but who are dedicated to ensuring that doesn't happen. Relocation is a daunting step to take, but willingness to do so in the event of the right offer is crucial to demonstrating committment to a successful relationship.</p>\n<h2>Takeaways</h2>\n<p>Overall, I feel lucky that I was able to identify this weakness in my approach and learn from it while I was still early in the job-seeking process. Moving forward, I will emphatically state my intention to locate myself as close to the opportunity as possible, so that I can be present and available when needed, free from the problems associated with a commute. I will trust that potential employers will take into consideration the distance from which I'm coming, and will negotiate for an appropriate relocation package with those that are willing to entertain me. I feel that it is in the best interest of both parties to operate in this fashion, and I'm eager to see the results of my new approach in the interviews ahead.</p>","frontmatter":{"title":"Locality Matters","excerpt":"\"I'll just commute into town on the train and spend four nights a week in a hotel while I'm getting settled into the new role.\""}}},"pageContext":{"slug":"/locality-matters/"}}